# NumSelectedObjects

## Description
Returns the number of selected objects in all working layers.

```pascal
FUNCTION NumSelectedObjects : LONGINT;
```

```python

def vs.NumSelectedObjects():
    return LONGINT
```

## Version
Availability: from Vectorworks 2010
## Category
* Selection